Enums/КИИ_КлассыРезультатаВалидацииОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КИИ_КлассыРезультатаВалидацииОтветаИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПройденаВалидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесовпадениеВычислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесовпадениеФормата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктурнаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствующаяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСсылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротиворечивыеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВалидатора</Name>
					<Comment>Ошибка выполнения доверенного кода валидатора. Требует ручной проверки человеком, без повторного запроса к модели.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КИИ_ТипыПолейСхемыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КИИ_ТипыПолейСхемыОтветаИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Целое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КИИ_СхемыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_СхемыОтветаИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалидаторОтвета</Name>
					<Comment>Доверенный валидатор для проверки всего ответа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Свойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КИИ_ТипыПолейСхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЗначения</Name>
							<Comment>Например ДД.ММ.ГГГГ для даты</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРодителя</Name>
							<Comment>Точечный путь для вложенных свойств</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалидаторПоля</Name>
							<Comment>Доверенный валидатор для проверки поля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложеннаяСхема</Name>
							<Comment>Для типов Объект и Массив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_СхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КИИ_МоделиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_МоделиИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоляТекста</Name>
					<Comment>Возможно content или text</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумТокенов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПровайдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КИИ_ТипыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФорматаAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КИИ_ТипыФорматовAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоддерживаетConstrainedDecoding</Name>
					<Comment>Модель ограничивает ответ по JSON Schema на этапе генерации</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КИИ_ВалидацияОтветаИИ/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Общий модуль валидации структурированных ответов модели ИИ по схеме.
//
// Контекст:
//  * Доверенный код валидаторов исполняется через ОбщегоНазначения.ВыполнитьВБезопасномРежиме.
//  * Между валидаторами КонтекстПроверки иммутабелен: каждый валидатор получает свою копию
//    структуры верхнего уровня, поэтому записи в КонтекстПроверки одного валидатора не видны
//    в следующих. Для передачи данных между валидаторами использовать Итог.Проверки.
//  * Подстановки приведённых значений в НормализованныйОтвет выполняются по результатам всех
//    проверок: см. ПроверитьОтветПоСхеме (двухфазное формирование).
//  * Защита от циклических вложенных схем реализована через ЦепочкаСсылок.

#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру результата одной проверки ответа модели.
//
// Возвращаемое значение:
//  Структура:
//   * Класс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//   * Сообщение - Строка
//   * ПутьКПолю - Строка - путь в JSON (точечная нотация) или пустая строка для проверки всего ответа
//   * КорневоеИмя - Строка - имя корневого поля для подстановки от валидатора всего ответа
//   * Значение1С - Произвольный - приведённое значение для подстановки в нормализованный ответ
//   * ПовторитьЗапрос - Булево
//   * НужнаПроверкаЧеловеком - Булево
//
Функция НовыйРезультатПроверки() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Класс", Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПустаяСсылка());
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("ПутьКПолю", "");
	Результат.Вставить("КорневоеИмя", "");
	Результат.Вставить("Значение1С", Неопределено);
	Результат.Вставить("ПовторитьЗапрос", Ложь);
	Результат.Вставить("НужнаПроверкаЧеловеком", Ложь);

	Возврат Результат;

КонецФункции

// Возвращает пустую структуру результата доверенного кода валидатора поля или всего ответа.
// Валидатор обязан вернуть заполненное поле Класс; остальные поля — по необходимости.
//
// Для валидатора всего ответа допускается задать поле КорневоеИмя — имя корневого поля
// нормализованного ответа, в которое будет записано Значение1С. Если КорневоеИмя пустое
// или не задано — подстановка не выполняется. Для валидатора поля КорневоеИмя игнорируется.
//
// Возвращаемое значение:
//  Структура:
//   * Класс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//   * Сообщение - Строка
//   * Значение1С - Произвольный - найденное или приведённое значение для подстановки
//   * КорневоеИмя - Строка - имя корневого поля для подстановки (только для валидатора всего ответа)
//
Функция НовыйРезультатВалидатора() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Класс", Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПустаяСсылка());
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Значение1С", Неопределено);
	Результат.Вставить("КорневоеИмя", "");

	Возврат Результат;

КонецФункции

// Проверяет, что структура результата валидатора соответствует контракту.
//
// Параметры:
//  РезультатВалидатора - Структура - см. НовыйРезультатВалидатора
//
// Возвращаемое значение:
//  Булево
//
Функция РезультатВалидатораКорректен(РезультатВалидатора) Экспорт

	Возврат ПустаяСтрока(ТекстОшибкиРезультатаВалидатора(РезультатВалидатора));

КонецФункции

// Преобразует результат доверенного валидатора в структуру проверки для агрегатора.
// Значение1С переносится только при классе «Пройдена валидация».
// КорневоеИмя переносится при любом классе — используется для диагностики и для подстановки.
//
// Параметры:
//  РезультатВалидатора - Структура - см. НовыйРезультатВалидатора
//  ПутьКПолю - Строка - путь проверяемого поля или пустая строка для проверки всего ответа
//
// Возвращаемое значение:
//  Структура - см. НовыйРезультатПроверки
//
Функция ПреобразоватьРезультатВалидатора(РезультатВалидатора, ПутьКПолю = "") Экспорт

	РезультатПроверки = НовыйРезультатПроверки();
	РезультатПроверки.ПутьКПолю = ПутьКПолю;

	ТекстОшибки = ТекстОшибкиРезультатаВалидатора(РезультатВалидатора);
	Если Не ПустаяСтрока(ТекстОшибки) Тогда

		РезультатПроверки.Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОшибкаВалидатора;
		РезультатПроверки.Сообщение = ТекстОшибки;
		УстановитьФлагиМаршрутизацииПоКлассу(РезультатПроверки);

		Возврат РезультатПроверки;

	КонецЕсли;

	РезультатПроверки.Класс = РезультатВалидатора.Класс;

	Если РезультатВалидатора.Свойство("Сообщение") Тогда
		РезультатПроверки.Сообщение = РезультатВалидатора.Сообщение;
	КонецЕсли;

	Если РезультатВалидатора.Свойство("КорневоеИмя")
		И ТипЗнч(РезультатВалидатора.КорневоеИмя) = Тип("Строка") Тогда

		РезультатПроверки.КорневоеИмя = СокрЛП(РезультатВалидатора.КорневоеИмя);

	КонецЕсли;

	Если КлассПройденаВалидация(РезультатВалидатора.Класс)
		И РезультатВалидатора.Свойство("Значение1С") Тогда

		РезультатПроверки.Значение1С = РезультатВалидатора.Значение1С;

	КонецЕсли;

	УстановитьФлагиМаршрутизацииПоКлассу(РезультатПроверки);

	Возврат РезультатПроверки;

КонецФункции

// Возвращает пустую структуру нормализованного ответа с типами 1С.
// Заполнение значений выполняется в процессе валидации.
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйНормализованныйОтвет() Экспорт

	Возврат Новый Структура;

КонецФункции

// Возвращает пустую структуру итога валидации ответа модели.
//
// Возвращаемое значение:
//  Структура:
//   * Проверки - Массив из Структура - см. НовыйРезультатПроверки
//   * ИтоговыйКласс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//   * НормализованныйОтвет - Структура - см. НовыйНормализованныйОтвет
//   * ПовторитьЗапрос - Булево
//   * НужнаПроверкаЧеловеком - Булево
//   * ПригоденДляПрименения - Булево
//   * ПовторыИсчерпаны - Булево
//   * ЛимитПовторныхЗапросов - Число
//   * КоличествоВыполненныхПовторов - Число
//   * Сообщение - Строка - сводное сообщение для пользователя
//
Функция НовыйИтогВалидации() Экспорт

	Итог = Новый Структура;
	Итог.Вставить("Проверки", Новый Массив);
	Итог.Вставить("ИтоговыйКласс", Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПустаяСсылка());
	Итог.Вставить("НормализованныйОтвет", НовыйНормализованныйОтвет());
	Итог.Вставить("ПовторитьЗапрос", Ложь);
	Итог.Вставить("НужнаПроверкаЧеловеком", Ложь);
	Итог.Вставить("ПригоденДляПрименения", Ложь);
	Итог.Вставить("ПовторыИсчерпаны", Ложь);
	Итог.Вставить("ЛимитПовторныхЗапросов", 0);
	Итог.Вставить("КоличествоВыполненныхПовторов", 0);
	Итог.Вставить("Сообщение", "");

	Возврат Итог;

КонецФункции

// Агрегирует список проверок в итоговую классификацию и флаги маршрутизации.
// НормализованныйОтвет не изменяется — он формируется на этапе валидации.
//
// Параметры:
//  Итог - Структура - см. НовыйИтогВалидации, поле Проверки должно быть заполнено
//
Процедура АгрегироватьРезультатыПроверок(Итог) Экспорт

	Если Итог.Проверки.Количество() = 0 Тогда
		Итог.ИтоговыйКласс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПройденаВалидация;
	Иначе
		Итог.ИтоговыйКласс = ОпределитьИтоговыйКласс(Итог.Проверки);
	КонецЕсли;

	Итог.ПовторитьЗапрос = КлассТребуетПовторногоЗапроса(Итог.ИтоговыйКласс);
	Итог.НужнаПроверкаЧеловеком = КлассТребуетПроверкиЧеловеком(Итог.ИтоговыйКласс);
	Итог.ПригоденДляПрименения = КлассПройденаВалидация(Итог.ИтоговыйКласс);
	Итог.Сообщение = СформироватьСводноеСообщение(Итог.Проверки);

КонецПроцедуры

// Применяет лимит повторных запросов эксперта к уже агрегированному итогу валидации.
//
// Параметры:
//  Итог - Структура - см. НовыйИтогВалидации
//  ЛимитПовторныхЗапросов - Число
//  КоличествоВыполненныхПовторов - Число - сколько повторов уже выполнено до текущей попытки
//
// Возвращаемое значение:
//  Структура - тот же итог с актуализированными флагами маршрутизации
//
Функция ПрименитьЛимитПовторныхЗапросов(Итог, ЛимитПовторныхЗапросов, КоличествоВыполненныхПовторов = 0) Экспорт

	Итог.ЛимитПовторныхЗапросов = ЛимитПовторныхЗапросов;
	Итог.КоличествоВыполненныхПовторов = КоличествоВыполненныхПовторов;
	Итог.ПовторыИсчерпаны = Ложь;

	Если Не Итог.ПовторитьЗапрос Тогда
		Возврат Итог;
	КонецЕсли;

	Если КоличествоВыполненныхПовторов >= ЛимитПовторныхЗапросов Тогда

		Итог.ПовторитьЗапрос = Ложь;
		Итог.ПовторыИсчерпаны = Истина;
		ДобавитьСообщениеВИтог(
			Итог,
			СтрШаблон(
				НСтр("ru = 'Исчерпан лимит повторных запросов к модели (%1 из %2).'"),
				КоличествоВыполненныхПовторов,
				ЛимитПовторныхЗапросов));

	КонецЕсли;

	Возврат Итог;

КонецФункции

// Определяет, допускает ли класс результата повторный запрос к модели.
//
// Параметры:
//  Класс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//
// Возвращаемое значение:
//  Булево
//
Функция КлассТребуетПовторногоЗапроса(Класс) Экспорт

	Возврат Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеВычислений
		Или Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеФормата
		Или Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка;

КонецФункции

// Определяет, требует ли класс результата ручной проверки человеком.
// Класс ОшибкаВалидатора (ошибка выполнения доверенного кода) маршрутизируется как ручная проверка
// и не вызывает повторного запроса к модели.
//
// Параметры:
//  Класс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//
// Возвращаемое значение:
//  Булево
//
Функция КлассТребуетПроверкиЧеловеком(Класс) Экспорт

	Возврат Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОтсутствующаяИнформация
		Или Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ВнешняяСсылка
		Или Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПротиворечивыеДанные
		Или Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОшибкаВалидатора;

КонецФункции

// Заполняет флаги маршрутизации в структуре результата проверки по классу.
//
// Параметры:
//  РезультатПроверки - Структура - см. НовыйРезультатПроверки
//
Процедура УстановитьФлагиМаршрутизацииПоКлассу(РезультатПроверки) Экспорт

	РезультатПроверки.ПовторитьЗапрос = КлассТребуетПовторногоЗапроса(РезультатПроверки.Класс);
	РезультатПроверки.НужнаПроверкаЧеловеком = КлассТребуетПроверкиЧеловеком(РезультатПроверки.Класс);

КонецПроцедуры

// Проверяет JSON-ответ модели по схеме и доверенным валидаторам 1С.
//
// Алгоритм:
//  1. Разбор JSON, проверка структуры на уровне корня.
//  2. Диагностика свойств схемы без типа.
//  3. Структурно-форматные проверки (только для моделей без Constrained Decoding).
//  4. Выполнение валидаторов полей и валидатора всего ответа над JSON-ответом.
//     На этом этапе формируется итоговый список проверок.
//  5. Построение карт ПутиПроблемныхПолей (поля с не-успешным классом) и ПодстановкиЗначений1С
//     (Значение1С от валидаторов с классом ПройденаВалидация).
//  6. Формирование нормализованного ответа: автоматическое приведение базовых типов с учётом
//     ПутиПроблемныхПолей (проблемные поля не записываются) и наложение подстановок.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//  Модель - СправочникСсылка.КИИ_МоделиИИ - модель, использованная для запроса
//  ТекстОтветаJSON - Строка
//  КонтекстПроверки - Структура - произвольный контекст для валидаторов (необязательно).
//                                  Передаётся в валидаторы по копии (см. ПодготовитьКонтекстПроверки).
//
// Возвращаемое значение:
//  Структура - см. НовыйИтогВалидации
//
Функция ПроверитьОтветПоСхеме(СхемаОтвета, Модель, ТекстОтветаJSON, КонтекстПроверки = Неопределено) Экспорт

	Итог = НовыйИтогВалидации();
	БазовыйКонтекст = ПодготовитьКонтекстПроверки(КонтекстПроверки);

	ОтветJSON = РазобратьТекстJSON(ТекстОтветаJSON);

	Если ОтветJSON = Неопределено Тогда

		ДобавитьПроверку(Итог, СформироватьПроверку(
			Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка,
			НСтр("ru = 'Не удалось разобрать JSON-ответ модели.'"),
			""));
		АгрегироватьРезультатыПроверок(Итог);

		Возврат Итог;

	КонецЕсли;

	Если ТипЗнч(ОтветJSON) <> Тип("Структура") Тогда

		ДобавитьПроверку(Итог, СформироватьПроверку(
			Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка,
			НСтр("ru = 'Корневой элемент JSON-ответа должен быть объектом.'"),
			""));
		АгрегироватьРезультатыПроверок(Итог);

		Возврат Итог;

	КонецЕсли;

	КэшСхем = Новый Соответствие;
	ДанныеСхемы = Справочники.КИИ_СхемыОтветаИИ.ПолучитьДанныеСхемы(СхемаОтвета);
	КэшСхем.Вставить(СхемаОтвета, ДанныеСхемы);

	ПоддерживаетConstrainedDecoding = МодельПоддерживаетConstrainedDecoding(Модель);

	ЦепочкаСсылок = Новый Массив;
	ЦепочкаСсылок.Добавить(СхемаОтвета);

	// Фаза 1: сбор проверок.

	ДиагностироватьСвойстваБезТипа(ДанныеСхемы, Итог);

	Если Не ПоддерживаетConstrainedDecoding Тогда
		ПроверитьСтруктуруИФорматУзла(
			ДанныеСхемы,
			"",
			ОтветJSON,
			"",
			Итог,
			КэшСхем,
			ЦепочкаСсылок);
	КонецЕсли;

	// Один батч на коды всех валидаторов (полей + валидатора всего ответа).
	ОписанияВалидаторовПолей = Справочники.КИИ_СхемыОтветаИИ.ПолучитьВалидаторыПолей(СхемаОтвета, КэшСхем);
	КодыВалидаторов = ПрочитатьКодыВалидаторов(ОписанияВалидаторовПолей, ДанныеСхемы.ВалидаторОтвета);

	ВыполнитьВалидаторыПолей(
		ДанныеСхемы,
		ОтветJSON,
		БазовыйКонтекст,
		Итог,
		КэшСхем,
		ЦепочкаСсылок,
		ОписанияВалидаторовПолей,
		КодыВалидаторов);

	КодВалидацииОтвета = КодыВалидаторов.Получить(ДанныеСхемы.ВалидаторОтвета);
	Если КодВалидацииОтвета <> Неопределено И Не ПустаяСтрока(СокрЛП(КодВалидацииОтвета)) Тогда
		ВыполнитьВалидаторОтвета(
			ДанныеСхемы,
			ОтветJSON,
			БазовыйКонтекст,
			Итог,
			КодВалидацииОтвета);
	КонецЕсли;

	// Фаза 2: нормализация ответа на основе собранных проверок.

	ПодстановкиЗначений1С = Новый Соответствие;
	ПутиПроблемныхПолей = Новый Соответствие;
	СобратьКартыПодстановокИПроблем(Итог.Проверки, ДанныеСхемы, ПодстановкиЗначений1С, ПутиПроблемныхПолей);

	СформироватьНормализованныйОтвет(
		ДанныеСхемы,
		"",
		ОтветJSON,
		"",
		Итог.НормализованныйОтвет,
		ПутиПроблемныхПолей,
		КэшСхем,
		ЦепочкаСсылок);

	ПрименитьПодстановкиЗначений1С(Итог.НормализованныйОтвет, ПодстановкиЗначений1С);

	АгрегироватьРезультатыПроверок(Итог);

	Возврат Итог;

КонецФункции

// Выводит итог валидации ответа модели в окно сообщений пользователю.
// Проверки группируются по классу; для каждой группы выводится количество и до 3 примеров.
// Если общее число проверок превышает ЛимитВыводаПроверокИтога, добавляется строка «и ещё N проверок».
//
// Параметры:
//  Итог - Структура - см. НовыйИтогВалидации
//
Процедура СообщитьИтогВалидацииПользователю(Итог) Экспорт

	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Валидация ответа ИИ: %1'"),
		Строка(Итог.ИтоговыйКласс)));

	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Пригоден: %1; повторить запрос: %2; ручная проверка: %3'"),
		ДаНетПоФлагу(Итог.ПригоденДляПрименения),
		ДаНетПоФлагу(Итог.ПовторитьЗапрос),
		ДаНетПоФлагу(Итог.НужнаПроверкаЧеловеком)));

	Если Не ПустаяСтрока(Итог.Сообщение) Тогда
		ОбщегоНазначения.СообщитьПользователю(Итог.Сообщение);
	КонецЕсли;

	ВсегоПроверок = Итог.Проверки.Количество();
	Если ВсегоПроверок = 0 Тогда
		Возврат;
	КонецЕсли;

	Группы = СгруппироватьПроверкиПоКлассу(Итог.Проверки);
	ВсегоПоказано = 0;
	ЛимитПримеров = 3;

	Для Каждого Группа Из Группы Цикл

		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = '%1: проверок %2'"),
			Строка(Группа.Класс),
			Группа.Проверки.Количество()));

		ПримерыКВыводу = Мин(ЛимитПримеров, Группа.Проверки.Количество());

		Для Индекс = 0 По ПримерыКВыводу - 1 Цикл
			Проверка = Группа.Проверки[Индекс];
			ОбщегоНазначения.СообщитьПользователю(СформироватьСтрокуПримераПроверки(Проверка));
		КонецЦикла;

		ВсегоПоказано = ВсегоПоказано + ПримерыКВыводу;

	КонецЦикла;

	Если ВсегоПроверок > ЛимитВыводаПроверокИтога() И ВсегоПроверок > ВсегоПоказано Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'и ещё %1 проверок (вывод ограничен лимитом).'"),
			ВсегоПроверок - ВсегоПоказано));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает максимально допустимое число проверок к подробному выводу пользователю.
//
Функция ЛимитВыводаПроверокИтога()

	Возврат 20;

КонецФункции

// Считывает коды доверенных валидаторов одним батчем — для полей и валидатора всего ответа.
//
// Параметры:
//  ОписанияВалидаторовПолей - Массив из Структура
//  ВалидаторОтвета - СправочникСсылка.КИИ_ВалидаторыОтветаИИ
//
// Возвращаемое значение:
//  Соответствие из Ключ: СправочникСсылка.КИИ_ВалидаторыОтветаИИ, Значение: Строка
//
Функция ПрочитатьКодыВалидаторов(ОписанияВалидаторовПолей, ВалидаторОтвета)

	СсылкиВалидаторов = Новый Массив;
	ВидимыеСсылки = Новый Соответствие;

	Для Каждого ОписаниеВалидатора Из ОписанияВалидаторовПолей Цикл
		Если Не ЗначениеЗаполнено(ОписаниеВалидатора.Валидатор) Тогда
			Продолжить;
		КонецЕсли;
		Если ВидимыеСсылки.Получить(ОписаниеВалидатора.Валидатор) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВидимыеСсылки.Вставить(ОписаниеВалидатора.Валидатор, Истина);
		СсылкиВалидаторов.Добавить(ОписаниеВалидатора.Валидатор);
	КонецЦикла;

	Если ЗначениеЗаполнено(ВалидаторОтвета)
		И ВидимыеСсылки.Получить(ВалидаторОтвета) = Неопределено Тогда

		ВидимыеСсылки.Вставить(ВалидаторОтвета, Истина);
		СсылкиВалидаторов.Добавить(ВалидаторОтвета);

	КонецЕсли;

	Возврат Справочники.КИИ_ВалидаторыОтветаИИ.КодыВалидации(СсылкиВалидаторов);

КонецФункции

// Возвращает текст ошибки контракта результата валидатора или пустую строку, если контракт соблюдён.
//
// Параметры:
//  РезультатВалидатора - Структура
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстОшибкиРезультатаВалидатора(РезультатВалидатора)

	Если РезультатВалидатора = Неопределено Тогда
		Возврат НСтр("ru = 'Результат валидатора не задан.'");
	КонецЕсли;

	Если ТипЗнч(РезультатВалидатора) <> Тип("Структура") Тогда
		Возврат НСтр("ru = 'Результат валидатора должен быть структурой.'");
	КонецЕсли;

	Если Не РезультатВалидатора.Свойство("Класс") Тогда
		Возврат НСтр("ru = 'Результат валидатора должен содержать поле ""Класс"".'");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(РезультатВалидатора.Класс) Тогда
		Возврат НСтр("ru = 'В результате валидатора не заполнен класс проверки.'");
	КонецЕсли;

	Если РезультатВалидатора.Свойство("Сообщение")
		И ТипЗнч(РезультатВалидатора.Сообщение) <> Тип("Строка") Тогда

		Возврат НСтр("ru = 'Поле ""Сообщение"" результата валидатора должно быть строкой.'");

	КонецЕсли;

	Если РезультатВалидатора.Свойство("КорневоеИмя")
		И ТипЗнч(РезультатВалидатора.КорневоеИмя) <> Тип("Строка") Тогда

		Возврат НСтр("ru = 'Поле ""КорневоеИмя"" результата валидатора должно быть строкой.'");

	КонецЕсли;

	Возврат "";

КонецФункции

// Определяет, соответствует ли класс успешному прохождению валидации.
//
// Параметры:
//  Класс - ПеречислениеСсылка.КИИ_КлассыРезультатаВалидацииОтветаИИ
//
// Возвращаемое значение:
//  Булево
//
Функция КлассПройденаВалидация(Класс)

	Возврат Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПройденаВалидация;

КонецФункции

// Готовит «базовый» контекст для валидаторов: возвращает поверхностную копию исходной структуры.
// Гарантирует иммутабельность контекста между валидаторами: каждый валидатор получит
// свою копию (см. СкопироватьКонтекстПроверки).
//
Функция ПодготовитьКонтекстПроверки(КонтекстПроверки)

	Если КонтекстПроверки = Неопределено Тогда
		Возврат Новый Структура;
	КонецЕсли;

	Если ТипЗнч(КонтекстПроверки) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Контекст проверки должен быть структурой.'");
	КонецЕсли;

	Возврат СкопироватьКонтекстПроверки(КонтекстПроверки);

КонецФункции

// Поверхностная копия структуры верхнего уровня. Используется перед каждым вызовом валидатора,
// чтобы изменения в одном валидаторе не влияли на следующие.
//
Функция СкопироватьКонтекстПроверки(КонтекстПроверки)

	Копия = Новый Структура;

	Если КонтекстПроверки = Неопределено Тогда
		Возврат Копия;
	КонецЕсли;

	Для Каждого КлючИЗначение Из КонтекстПроверки Цикл
		Копия.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	Возврат Копия;

КонецФункции

Функция МодельПоддерживаетConstrainedDecoding(Модель)

	Если Не ЗначениеЗаполнено(Модель) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Справочники.КИИ_МоделиИИ.ПоддерживаетConstrainedDecoding(Модель);

КонецФункции

// Разбирает текст ответа модели в значение JSON.
// Последовательность попыток: текст «как есть» → без markdown-обёртки → выделить сбалансированный
// объект из текста без markdown. Возвращает Неопределено, если разбор не удался.
//
Функция РазобратьТекстJSON(ТекстОтветаJSON)

	Если ПустаяСтрока(СокрЛП(ТекстОтветаJSON)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИсходныйТекст = СокрЛП(ТекстОтветаJSON);

	ОтветJSON = ПрочитатьJSONИзСтроки(ИсходныйТекст);
	Если ОтветJSON <> Неопределено Тогда
		Возврат ОтветJSON;
	КонецЕсли;

	БезМаркдауна = СнятьMarkdownОберткуJSON(ИсходныйТекст);
	ОтветJSON = ПрочитатьJSONИзСтроки(БезМаркдауна);
	Если ОтветJSON <> Неопределено Тогда
		Возврат ОтветJSON;
	КонецЕсли;

	Фрагмент = ИзвлечьПервыйJSONОбъектИзТекста(БезМаркдауна);
	Возврат ПрочитатьJSONИзСтроки(Фрагмент);

КонецФункции

// Снимает markdown-обертку ```...``` (с опциональным идентификатором языка и переводом строки)
// и обрезает текст по первому встретившемуся закрывающему ```.
//
Функция СнятьMarkdownОберткуJSON(Текст)

	Очищенный = СокрЛ(Текст);

	Если Не СтрНачинаетсяС(Очищенный, "```") Тогда
		Возврат Текст;
	КонецЕсли;

	// Снять открывающий fence ```.
	Очищенный = Сред(Очищенный, 4);

	// Снять опциональный идентификатор языка до первого перевода строки.
	ПозицияПС = СтрНайти(Очищенный, Символы.ПС);
	Если ПозицияПС > 0 Тогда
		Очищенный = Сред(Очищенный, ПозицияПС + 1);
	КонецЕсли;

	// Обрезать по первому закрывающему ```.
	ПозицияЗакрытия = СтрНайти(Очищенный, "```");
	Если ПозицияЗакрытия > 0 Тогда
		Очищенный = Лев(Очищенный, ПозицияЗакрытия - 1);
	КонецЕсли;

	Возврат СокрЛП(Очищенный);

КонецФункции

// Извлекает первый сбалансированный JSON-объект {...} из произвольного текста.
Функция ИзвлечьПервыйJSONОбъектИзТекста(Текст)

	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;

	ПозицияНачала = СтрНайти(Текст, "{");

	Пока ПозицияНачала > 0 Цикл

		Фрагмент = ИзвлечьСбалансированныйJSONФрагмент(Текст, ПозицияНачала, "{", "}");

		Если Не ПустаяСтрока(Фрагмент) Тогда
			Возврат Фрагмент;
		КонецЕсли;

		ПозицияНачала = СтрНайти(Текст, "{", , ПозицияНачала + 1);

	КонецЦикла;

	Возврат "";

КонецФункции

Функция ИзвлечьСбалансированныйJSONФрагмент(Текст, НачальнаяПозиция, ОткрывающийСимвол, ЗакрывающийСимвол)

	Глубина = 0;
	ВСтроке = Ложь;
	Экранирование = Ложь;
	ДлинаТекста = СтрДлина(Текст);

	Для НомерСимвола = НачальнаяПозиция По ДлинаТекста Цикл

		Символ = Сред(Текст, НомерСимвола, 1);

		Если Экранирование Тогда

			Экранирование = Ложь;
			Продолжить;

		КонецЕсли;

		Если ВСтроке Тогда

			Если Символ = "\" Тогда
				Экранирование = Истина;
			ИначеЕсли Символ = """" Тогда
				ВСтроке = Ложь;
			Иначе
				// Символ внутри строки JSON — без действий.
			КонецЕсли;

			Продолжить;

		КонецЕсли;

		Если Символ = """" Тогда

			ВСтроке = Истина;
			Продолжить;

		КонецЕсли;

		Если Символ = ОткрывающийСимвол Тогда

			Глубина = Глубина + 1;

		ИначеЕсли Символ = ЗакрывающийСимвол Тогда

			Глубина = Глубина - 1;

			Если Глубина = 0 Тогда
				Возврат Сред(Текст, НачальнаяПозиция, НомерСимвола - НачальнаяПозиция + 1);
			КонецЕсли;

		Иначе
			// Символ вне строки и скобок — без действий.
		КонецЕсли;

	КонецЦикла;

	Возврат "";

КонецФункции

Функция ПрочитатьJSONИзСтроки(ТекстJSON)

	Если ПустаяСтрока(ТекстJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	Результат = Неопределено;

	Попытка
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Результат = Неопределено;
	КонецПопытки;

	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

Процедура ДобавитьПроверку(Итог, РезультатПроверки)

	Итог.Проверки.Добавить(РезультатПроверки);

КонецПроцедуры

Функция СформироватьПроверку(Класс, Сообщение, ПутьКПолю, Значение1С = Неопределено)

	РезультатПроверки = НовыйРезультатПроверки();
	РезультатПроверки.Класс = Класс;
	РезультатПроверки.Сообщение = Сообщение;
	РезультатПроверки.ПутьКПолю = ПутьКПолю;
	РезультатПроверки.Значение1С = Значение1С;
	УстановитьФлагиМаршрутизацииПоКлассу(РезультатПроверки);

	Возврат РезультатПроверки;

КонецФункции

Функция СформироватьСводноеСообщение(Проверки)

	Сообщения = Новый Массив;

	Для Каждого РезультатПроверки Из Проверки Цикл

		Если Не ПустаяСтрока(РезультатПроверки.Сообщение) Тогда
			Сообщения.Добавить(РезультатПроверки.Сообщение);
		КонецЕсли;

	КонецЦикла;

	Возврат СтрСоединить(Сообщения, Символы.ПС);

КонецФункции

Процедура ДобавитьСообщениеВИтог(Итог, ТекстСообщения)

	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Итог.Сообщение) Тогда
		Итог.Сообщение = ТекстСообщения;
		Возврат;
	КонецЕсли;

	Итог.Сообщение = Итог.Сообщение + Символы.ПС + ТекстСообщения;

КонецПроцедуры

Функция ОпределитьИтоговыйКласс(Проверки)

	Приоритеты = Новый Массив;
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПротиворечивыеДанные);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ВнешняяСсылка);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОшибкаВалидатора);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОтсутствующаяИнформация);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеФормата);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеВычислений);
	Приоритеты.Добавить(Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПройденаВалидация);

	Для Каждого КлассПриоритет Из Приоритеты Цикл

		Для Каждого РезультатПроверки Из Проверки Цикл

			Если РезультатПроверки.Класс = КлассПриоритет Тогда
				Возврат КлассПриоритет;
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ПройденаВалидация;

КонецФункции

// Диагностирует свойства схемы, для которых не задан Тип.
// Такие поля исключаются из автоматического приведения и попадают в Итог.Проверки
// как СтруктурнаяОшибка.
//
Процедура ДиагностироватьСвойстваБезТипа(ДанныеСхемы, Итог)

	Для Каждого СтрокаСвойства Из ДанныеСхемы.Свойства Цикл

		Если ЗначениеЗаполнено(СтрокаСвойства.Тип) Тогда
			Продолжить;
		КонецЕсли;

		ПутьКПолю = СформироватьДочернийПутьСхемы(СтрокаСвойства.ПутьРодителя, СтрокаСвойства.Имя);
		ДобавитьПроверку(Итог, СформироватьПроверку(
			Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка,
			СтрШаблон(
				НСтр("ru = 'Для свойства схемы ""%1"" не задан тип.'"),
				СтрокаСвойства.Имя),
			ПутьКПолю));

	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьСтруктуруИФорматУзла(ДанныеСхемы, ПутьРодителяСхемы, ЗначениеУзла, ПутьJSON, Итог, КэшСхем, ЦепочкаСсылок)

	СвойстваУзла = ОтфильтроватьСвойстваСхемы(ДанныеСхемы.Свойства, ПутьРодителяСхемы);

	Для Каждого СтрокаСвойства Из СвойстваУзла Цикл

		Если Не ЗначениеЗаполнено(СтрокаСвойства.Тип) Тогда
			Продолжить;
		КонецЕсли;

		ПутьКПолю = СформироватьПолныйПутьJSON(ПутьJSON, СтрокаСвойства.Имя);
		ЗначениеПоля = ПолучитьЗначениеСвойстваУзла(ЗначениеУзла, СтрокаСвойства.Имя);
		ПолеОтсутствует = ЗначениеПоляОтсутствует(ЗначениеПоля);

		Если СтрокаСвойства.Обязательное И ПолеОтсутствует Тогда

			ДобавитьПроверку(Итог, СформироватьПроверку(
				Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.СтруктурнаяОшибка,
				СтрШаблон(НСтр("ru = 'Отсутствует обязательное поле ""%1"".'"), СтрокаСвойства.Имя),
				ПутьКПолю));
			Продолжить;

		КонецЕсли;

		Если ПолеОтсутствует Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект Тогда

			Если ТипЗнч(ЗначениеПоля) <> Тип("Структура") Тогда
				ДобавитьПроверку(Итог, СформироватьПроверку(
					Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеФормата,
					СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть объектом.'"), СтрокаСвойства.Имя),
					ПутьКПолю));
				Продолжить;
			КонецЕсли;

			НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
			ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
			ПутьРодителяВложенного = ПутьРодителяВложенногоОбъекта(ДанныеСхемы, СтрокаСвойства);
			ПроверитьСтруктуруИФорматУзла(
				ДанныеВложеннойСхемы,
				ПутьРодителяВложенного,
				ЗначениеПоля,
				ПутьКПолю,
				Итог,
				КэшСхем,
				НоваяЦепочка);
			Продолжить;

		КонецЕсли;

		Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда

			Если ТипЗнч(ЗначениеПоля) <> Тип("Массив") Тогда
				ДобавитьПроверку(Итог, СформироватьПроверку(
					Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеФормата,
					СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть массивом.'"), СтрокаСвойства.Имя),
					ПутьКПолю));
				Продолжить;
			КонецЕсли;

			НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
			ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
			ПутьРодителяЭлемента = СформироватьДочернийПутьСхемы(ПутьРодителяСхемы, СтрокаСвойства.Имя);

			Для Индекс = 0 По ЗначениеПоля.Количество() - 1 Цикл
				ПутьЭлемента = СформироватьПолныйПутьJSON(ПутьКПолю, Строка(Индекс));
				ПроверитьСтруктуруИФорматУзла(
					ДанныеВложеннойСхемы,
					ПутьРодителяЭлемента,
					ЗначениеПоля[Индекс],
					ПутьЭлемента,
					Итог,
					КэшСхем,
					НоваяЦепочка);
			КонецЦикла;

			Продолжить;

		КонецЕсли;

		СообщениеФормата = ТекстОшибкиФорматаПоля(СтрокаСвойства, ЗначениеПоля);
		Если Не ПустаяСтрока(СообщениеФормата) Тогда
			ДобавитьПроверку(Итог, СформироватьПроверку(
				Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.НесовпадениеФормата,
				СообщениеФормата,
				ПутьКПолю));
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Двухфазное формирование: запись листьев напрямую в текущий контейнер уровня (Структура/Массив).
// Проблемные пути и поля без типа в нормализованный ответ не пишутся.
//
Процедура СформироватьНормализованныйОтвет(
	ДанныеСхемы,
	ПутьРодителяСхемы,
	ЗначениеУзла,
	ПутьJSON,
	КонтейнерВывода,
	ПутиПроблемныхПолей,
	КэшСхем,
	ЦепочкаСсылок)

	СвойстваУзла = ОтфильтроватьСвойстваСхемы(ДанныеСхемы.Свойства, ПутьРодителяСхемы);

	Для Каждого СтрокаСвойства Из СвойстваУзла Цикл

		// Свойства без типа исключаются из нормализации (см. ДиагностироватьСвойстваБезТипа).
		Если Не ЗначениеЗаполнено(СтрокаСвойства.Тип) Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеПоля = ПолучитьЗначениеСвойстваУзла(ЗначениеУзла, СтрокаСвойства.Имя);
		Если ЗначениеПоляОтсутствует(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;

		ПутьКПолю = СформироватьПолныйПутьJSON(ПутьJSON, СтрокаСвойства.Имя);

		Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект Тогда

			Если ТипЗнч(ЗначениеПоля) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;

			ВложенныйКонтейнер = Новый Структура;
			ЗаписатьЗначениеВКонтейнер(КонтейнерВывода, СтрокаСвойства.Имя, ВложенныйКонтейнер);

			НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
			ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
			ПутьРодителяВложенного = ПутьРодителяВложенногоОбъекта(ДанныеСхемы, СтрокаСвойства);

			СформироватьНормализованныйОтвет(
				ДанныеВложеннойСхемы,
				ПутьРодителяВложенного,
				ЗначениеПоля,
				ПутьКПолю,
				ВложенныйКонтейнер,
				ПутиПроблемныхПолей,
				КэшСхем,
				НоваяЦепочка);
			Продолжить;

		КонецЕсли;

		Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда

			Если ТипЗнч(ЗначениеПоля) <> Тип("Массив") Тогда
				Продолжить;
			КонецЕсли;

			НормализованныйМассив = Новый Массив;
			ЗаписатьЗначениеВКонтейнер(КонтейнерВывода, СтрокаСвойства.Имя, НормализованныйМассив);

			НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
			ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
			ПутьРодителяЭлемента = СформироватьДочернийПутьСхемы(ПутьРодителяСхемы, СтрокаСвойства.Имя);

			Для Индекс = 0 По ЗначениеПоля.Количество() - 1 Цикл

				ПутьЭлемента = СформироватьПолныйПутьJSON(ПутьКПолю, Строка(Индекс));

				Если ТипЗнч(ЗначениеПоля[Индекс]) = Тип("Структура") Тогда

					ЭлементКонтейнер = Новый Структура;
					НормализованныйМассив.Добавить(ЭлементКонтейнер);

					СформироватьНормализованныйОтвет(
						ДанныеВложеннойСхемы,
						ПутьРодителяЭлемента,
						ЗначениеПоля[Индекс],
						ПутьЭлемента,
						ЭлементКонтейнер,
						ПутиПроблемныхПолей,
						КэшСхем,
						НоваяЦепочка);

				ИначеЕсли ТипЗнч(ЗначениеПоля[Индекс]) = Тип("Массив") Тогда

					ВложенныйМассив = Новый Массив;
					НормализованныйМассив.Добавить(ВложенныйМассив);

					СформироватьНормализованныйОтвет(
						ДанныеВложеннойСхемы,
						ПутьРодителяЭлемента,
						ЗначениеПоля[Индекс],
						ПутьЭлемента,
						ВложенныйМассив,
						ПутиПроблемныхПолей,
						КэшСхем,
						НоваяЦепочка);

				КонецЕсли;

				// Примитивные элементы массива в нормализованный ответ не добавляются явно —
				// сохраняем поведение, при котором массивы примитивов остаются вне нормализации.

			КонецЦикла;

			Продолжить;

		КонецЕсли;

		// Лист: автоматическое приведение пропускается для проблемных полей.
		Если ПутиПроблемныхПолей.Получить(ПутьКПолю) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НормализованноеЗначение = ПривестиЗначениеПоля(СтрокаСвойства, ЗначениеПоля);
		Если НормализованноеЗначение = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЗаписатьЗначениеВКонтейнер(КонтейнерВывода, СтрокаСвойства.Имя, НормализованноеЗначение);

	КонецЦикла;

КонецПроцедуры

// Накладывает подстановки Значение1С от валидаторов поверх автоматически приведённого ответа.
//
Процедура ПрименитьПодстановкиЗначений1С(НормализованныйОтвет, ПодстановкиЗначений1С)

	Если ПодстановкиЗначений1С.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого КлючИЗначение Из ПодстановкиЗначений1С Цикл

		Путь = КлючИЗначение.Ключ;
		Если ПустаяСтрока(Путь) Тогда
			Продолжить;
		КонецЕсли;

		УстановитьЗначениеПоПути(НормализованныйОтвет, Путь, КлючИЗначение.Значение);

	КонецЦикла;

КонецПроцедуры

// Собирает карты подстановок Значение1С и проблемных путей по результатам проверок.
//
Процедура СобратьКартыПодстановокИПроблем(Проверки, ДанныеСхемы, ПодстановкиЗначений1С, ПутиПроблемныхПолей)

	КорневыеИмена = СобратьКорневыеИмена(ДанныеСхемы);

	Для Каждого Проверка Из Проверки Цикл

		Если КлассПройденаВалидация(Проверка.Класс) Тогда

			Если Проверка.Значение1С = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если Не ПустаяСтрока(Проверка.ПутьКПолю) Тогда
				ПодстановкиЗначений1С.Вставить(Проверка.ПутьКПолю, Проверка.Значение1С);
				Продолжить;
			КонецЕсли;

			Если Не ПустаяСтрока(Проверка.КорневоеИмя)
				И КорневыеИмена.Получить(Проверка.КорневоеИмя) <> Неопределено Тогда

				ПодстановкиЗначений1С.Вставить(Проверка.КорневоеИмя, Проверка.Значение1С);

			КонецЕсли;

		Иначе

			Если Не ПустаяСтрока(Проверка.ПутьКПолю) Тогда
				ПутиПроблемныхПолей.Вставить(Проверка.ПутьКПолю, Истина);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция СобратьКорневыеИмена(ДанныеСхемы)

	КорневыеИмена = Новый Соответствие;

	Для Каждого СтрокаСвойства Из ДанныеСхемы.Свойства Цикл

		Если СокрЛП(СтрокаСвойства.ПутьРодителя) <> "" Тогда
			Продолжить;
		КонецЕсли;

		Имя = СокрЛП(СтрокаСвойства.Имя);
		Если ПустаяСтрока(Имя) Тогда
			Продолжить;
		КонецЕсли;

		КорневыеИмена.Вставить(Имя, Истина);

	КонецЦикла;

	Возврат КорневыеИмена;

КонецФункции

// Выполняет валидаторы полей по описаниям из схемы. Подстановка Значение1С не выполняется здесь —
// она делается в фазе формирования нормализованного ответа на основе собранных проверок.
//
Процедура ВыполнитьВалидаторыПолей(
	ДанныеСхемы,
	ОтветJSON,
	БазовыйКонтекст,
	Итог,
	КэшСхем,
	ЦепочкаСсылок,
	ОписанияВалидаторовПолей,
	КодыВалидаторов)

	Для Каждого ОписаниеВалидатора Из ОписанияВалидаторовПолей Цикл

		КодВалидации = КодыВалидаторов.Получить(ОписаниеВалидатора.Валидатор);
		Если КодВалидации = Неопределено Или ПустаяСтрока(СокрЛП(КодВалидации)) Тогда
			Продолжить;
		КонецЕсли;

		ПутиJSON = РазвернутьПутиJSON(ДанныеСхемы, ОписаниеВалидатора.ПутьКПолю, ОтветJSON, КэшСхем, ЦепочкаСсылок);

		Для Каждого ПараПутьЗначение Из ПутиJSON Цикл

			КонтекстПроверки = СкопироватьКонтекстПроверки(БазовыйКонтекст);
			РезультатВалидатора = ВыполнитьДоверенныйКодВалидации(
				КодВалидации,
				ПараПутьЗначение.Значение,
				ПараПутьЗначение.Путь,
				ОтветJSON,
				КонтекстПроверки);

			Если РезультатВалидатора = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			РезультатПроверки = ПреобразоватьРезультатВалидатора(РезультатВалидатора, ПараПутьЗначение.Путь);
			ДобавитьПроверку(Итог, РезультатПроверки);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// Выполняет валидатор всего ответа. Подстановка значения выполняется в фазе формирования
// нормализованного ответа по полю КорневоеИмя результата валидатора.
//
Процедура ВыполнитьВалидаторОтвета(ДанныеСхемы, ОтветJSON, БазовыйКонтекст, Итог, КодВалидации)

	КонтекстПроверки = СкопироватьКонтекстПроверки(БазовыйКонтекст);
	РезультатВалидатора = ВыполнитьДоверенныйКодВалидации(
		КодВалидации,
		Неопределено,
		"",
		ОтветJSON,
		КонтекстПроверки);

	Если РезультатВалидатора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РезультатПроверки = ПреобразоватьРезультатВалидатора(РезультатВалидатора, "");
	ДобавитьПроверку(Итог, РезультатПроверки);

	// Диагностика: КорневоеИмя должно совпадать с одним из корневых полей схемы (если задано).
	Если ПустаяСтрока(РезультатПроверки.КорневоеИмя) Тогда
		Возврат;
	КонецЕсли;

	КорневыеИмена = СобратьКорневыеИмена(ДанныеСхемы);
	Если КорневыеИмена.Получить(РезультатПроверки.КорневоеИмя) = Неопределено Тогда

		ДобавитьПроверку(Итог, СформироватьПроверку(
			Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОшибкаВалидатора,
			СтрШаблон(
				НСтр("ru = 'Валидатор всего ответа вернул КорневоеИмя ""%1"", которого нет среди корневых полей схемы.'"),
				РезультатПроверки.КорневоеИмя),
			""));

	КонецЕсли;

КонецПроцедуры

// Возвращает результат доверенного валидатора. При исключении внутри доверенного кода —
// результат класса ОшибкаВалидатора (маршрутизируется как ручная проверка человеком).
//
Функция ВыполнитьДоверенныйКодВалидации(КодВалидации, ЗначениеПоля, ПутьКПолю, ОтветJSON, КонтекстПроверки)

	Код = СокрЛП(КодВалидации);
	Если ПустаяСтрока(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ЗначениеПоля", ЗначениеПоля);
	ПараметрыВыполнения.Вставить("ПутьКПолю", ПутьКПолю);
	ПараметрыВыполнения.Вставить("ОтветJSON", ОтветJSON);
	ПараметрыВыполнения.Вставить("КонтекстПроверки", КонтекстПроверки);
	ПараметрыВыполнения.Вставить("Результат", НовыйРезультатВалидатора());

	ПараметрыПроверкиАлгоритма = ОбщегоНазначения.ПараметрыПроверкиАлгоритма();
	ПараметрыПроверкиАлгоритма.НедопустимыеМетоды.Добавить("Выполнить");
	ПараметрыПроверкиАлгоритма.НедопустимыеМетоды.Добавить("Вычислить");

	КодСКонтекстом = ОбернутьКодВалидации(Код);

	Попытка
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(КодСКонтекстом, ПараметрыВыполнения, ПараметрыПроверкиАлгоритма);
	Исключение
		РезультатОшибки = НовыйРезультатВалидатора();
		РезультатОшибки.Класс = Перечисления.КИИ_КлассыРезультатаВалидацииОтветаИИ.ОшибкаВалидатора;
		РезультатОшибки.Сообщение = СтрШаблон(
			НСтр("ru = 'Ошибка выполнения доверенного валидатора: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат РезультатОшибки;
	КонецПопытки;

	Возврат ПараметрыВыполнения.Результат;

КонецФункции

// Добавляет преамбулу для доступа к контексту валидатора по именам из контракта.
//
// Параметры:
//  КодВалидации - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ОбернутьКодВалидации(КодВалидации)

	Преамбула =
	"ЗначениеПоля = Параметры.ЗначениеПоля;
	|ПутьКПолю = Параметры.ПутьКПолю;
	|ОтветJSON = Параметры.ОтветJSON;
	|КонтекстПроверки = Параметры.КонтекстПроверки;
	|Результат = Параметры.Результат;
	|";

	Возврат Преамбула + КодВалидации;

КонецФункции

// Возвращает массив пар { Путь, Значение } — раскрытые JSON-пути для путей схемы (с массивами).
// Если развернуть не удалось — возвращает одну пару с исходным путём и значением по нему.
//
Функция РазвернутьПутиJSON(ДанныеСхемы, ПутьКПолю, ОтветJSON, КэшСхем, ЦепочкаСсылок)

	Результат = Новый Массив;
	РазвернутьПутьJSONРекурсивно(ДанныеСхемы, "", "", ПутьКПолю, ОтветJSON, КэшСхем, ЦепочкаСсылок, Результат);

	Если Результат.Количество() = 0 Тогда

		Пара = Новый Структура;
		Пара.Вставить("Путь", ПутьКПолю);
		Пара.Вставить("Значение", ПолучитьЗначениеПоПути(ОтветJSON, ПутьКПолю));
		Результат.Добавить(Пара);

	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура РазвернутьПутьJSONРекурсивно(
	ДанныеСхемы,
	ПутьРодителяСхемы,
	ПутьJSON,
	ОстатокПути,
	ТекущийУзел,
	КэшСхем,
	ЦепочкаСсылок,
	Результат)

	Если ПустаяСтрока(ОстатокПути) Тогда
		Возврат;
	КонецЕсли;

	Части = СтрРазделить(ОстатокПути, ".", Ложь);
	ИмяПоля = Части[0];
	Остаток = СформироватьОстатокПути(Части);

	СтрокаСвойства = НайтиСтрокуСхемы(ДанныеСхемы, ПутьРодителяСхемы, ИмяПоля);
	Если СтрокаСвойства = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначениеПоля = ПолучитьЗначениеСвойстваУзла(ТекущийУзел, ИмяПоля);

	Если СтрокаСвойства.Тип <> Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда

		ПутьПоляJSON = СформироватьПолныйПутьJSON(ПутьJSON, ИмяПоля);

		Если ПустаяСтрока(Остаток) Тогда

			Пара = Новый Структура;
			Пара.Вставить("Путь", ПутьПоляJSON);
			Пара.Вставить("Значение", ЗначениеПоля);
			Результат.Добавить(Пара);
			Возврат;

		КонецЕсли;

		НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
		ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
		ПутьРодителяВложенного = ПутьРодителяВложенногоОбъекта(ДанныеСхемы, СтрокаСвойства);
		РазвернутьПутьJSONРекурсивно(
			ДанныеВложеннойСхемы,
			ПутьРодителяВложенного,
			ПутьПоляJSON,
			Остаток,
			ЗначениеПоля,
			КэшСхем,
			НоваяЦепочка,
			Результат);
		Возврат;

	КонецЕсли;

	ПутьМассива = СформироватьПолныйПутьJSON(ПутьJSON, ИмяПоля);

	Если ТипЗнч(ЗначениеПоля) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	НоваяЦепочка = ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок);
	ДанныеВложеннойСхемы = ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем);
	ПутьРодителяЭлемента = СформироватьДочернийПутьСхемы(ПутьРодителяСхемы, ИмяПоля);

	Для Индекс = 0 По ЗначениеПоля.Количество() - 1 Цикл

		ПутьЭлемента = СформироватьПолныйПутьJSON(ПутьМассива, Строка(Индекс));

		Если ПустаяСтрока(Остаток) Тогда

			Пара = Новый Структура;
			Пара.Вставить("Путь", ПутьЭлемента);
			Пара.Вставить("Значение", ЗначениеПоля[Индекс]);
			Результат.Добавить(Пара);

		Иначе

			РазвернутьПутьJSONРекурсивно(
				ДанныеВложеннойСхемы,
				ПутьРодителяЭлемента,
				ПутьЭлемента,
				Остаток,
				ЗначениеПоля[Индекс],
				КэшСхем,
				НоваяЦепочка,
				Результат);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция СформироватьОстатокПути(Части)

	Если Части.Количество() <= 1 Тогда
		Возврат "";
	КонецЕсли;

	ОстатокЧасти = Новый Массив;

	Для Индекс = 1 По Части.Количество() - 1 Цикл
		ОстатокЧасти.Добавить(Части[Индекс]);
	КонецЦикла;

	Возврат СтрСоединить(ОстатокЧасти, ".");

КонецФункции

// Возвращает данные для следующего узла обхода. При входе во вложенную схему — данные именно
// вложенной схемы; обновление цепочки ссылок выполняется отдельно (см. ОбновитьЦепочкуСсылокДляВложеннойСхемы).
//
Функция ПолучитьДанныеВложеннойСхемы(ДанныеСхемы, СтрокаСвойства, КэшСхем)

	Если ЗначениеЗаполнено(СтрокаСвойства.ВложеннаяСхема) Тогда

		ДанныеВложеннойСхемы = КэшСхем.Получить(СтрокаСвойства.ВложеннаяСхема);
		Если ДанныеВложеннойСхемы = Неопределено Тогда
			ДанныеВложеннойСхемы = Справочники.КИИ_СхемыОтветаИИ.ПолучитьДанныеСхемы(СтрокаСвойства.ВложеннаяСхема);
			КэшСхем.Вставить(СтрокаСвойства.ВложеннаяСхема, ДанныеВложеннойСхемы);
		КонецЕсли;

		Возврат ДанныеВложеннойСхемы;

	КонецЕсли;

	Возврат ДанныеСхемы;

КонецФункции

// Возвращает обновлённую цепочку ссылок перед входом во вложенную схему.
// При обнаружении цикла (схема уже в цепочке) выбрасывает исключение с диагностикой.
// Стиль текста — совместим с менеджером схемы (см. Справочники.КИИ_СхемыОтветаИИ.ПроверитьЦиклическуюСсылку).
//
Функция ОбновитьЦепочкуСсылокДляВложеннойСхемы(СтрокаСвойства, ЦепочкаСсылок)

	Если Не ЗначениеЗаполнено(СтрокаСвойства.ВложеннаяСхема) Тогда
		Возврат ЦепочкаСсылок;
	КонецЕсли;

	Если ЦепочкаСсылок.Найти(СтрокаСвойства.ВложеннаяСхема) <> Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Обнаружена циклическая ссылка между схемами ответа ИИ через свойство ""%1"".'"),
			СтрокаСвойства.Имя);
	КонецЕсли;

	НоваяЦепочка = СкопироватьЦепочкуСсылок(ЦепочкаСсылок);
	НоваяЦепочка.Добавить(СтрокаСвойства.ВложеннаяСхема);

	Возврат НоваяЦепочка;

КонецФункции

Функция СкопироватьЦепочкуСсылок(ЦепочкаСсылок)

	НоваяЦепочка = Новый Массив;

	Для Каждого ЭлементЦепочки Из ЦепочкаСсылок Цикл
		НоваяЦепочка.Добавить(ЭлементЦепочки);
	КонецЦикла;

	Возврат НоваяЦепочка;

КонецФункции

Функция ПутьРодителяВложенногоОбъекта(ДанныеСхемы, СтрокаСвойства)

	Если ЗначениеЗаполнено(СтрокаСвойства.ВложеннаяСхема) Тогда
		Возврат "";
	КонецЕсли;

	Возврат СформироватьДочернийПутьСхемы(СтрокаСвойства.ПутьРодителя, СтрокаСвойства.Имя);

КонецФункции

Функция ОтфильтроватьСвойстваСхемы(Свойства, ПутьРодителя)

	Результат = Новый Массив;
	НормализованныйПуть = СокрЛП(ПутьРодителя);

	Для Каждого СтрокаСвойства Из Свойства Цикл

		Если СтрокаСвойства.ПутьРодителя = НормализованныйПуть Тогда
			Результат.Добавить(СтрокаСвойства);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НайтиСтрокуСхемы(ДанныеСхемы, ПутьРодителя, ИмяПоля)

	НормализованныйПуть = СокрЛП(ПутьРодителя);

	Для Каждого СтрокаСвойства Из ДанныеСхемы.Свойства Цикл

		Если СтрокаСвойства.ПутьРодителя = НормализованныйПуть
			И СтрокаСвойства.Имя = ИмяПоля Тогда

			Возврат СтрокаСвойства;

		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция СформироватьДочернийПутьСхемы(ПутьРодителя, ИмяПоля)

	НормализованныйПуть = СокрЛП(ПутьРодителя);

	Если ПустаяСтрока(НормализованныйПуть) Тогда
		Возврат СокрЛП(ИмяПоля);
	КонецЕсли;

	Возврат НормализованныйПуть + "." + СокрЛП(ИмяПоля);

КонецФункции

Функция СформироватьПолныйПутьJSON(ПутьJSON, ИмяЧасти)

	Имя = СокрЛП(ИмяЧасти);

	Если ПустаяСтрока(ПутьJSON) Тогда
		Возврат Имя;
	КонецЕсли;

	Возврат ПутьJSON + "." + Имя;

КонецФункции

Функция ПолучитьЗначениеСвойстваУзла(ЗначениеУзла, ИмяПоля)

	Если ТипЗнч(ЗначениеУзла) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Не ЗначениеУзла.Свойство(ИмяПоля) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ЗначениеУзла[ИмяПоля];

КонецФункции

Функция ЗначениеПоляОтсутствует(ЗначениеПоля)

	Возврат ЗначениеПоля = Неопределено;

КонецФункции

Функция ПолучитьЗначениеПоПути(Данные, Путь)

	Если ПустаяСтрока(Путь) Тогда
		Возврат Данные;
	КонецЕсли;

	Части = СтрРазделить(Путь, ".", Ложь);
	Текущее = Данные;

	Для Каждого ИмяЧасти Из Части Цикл

		Если Текущее = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;

		Если ТипЗнч(Текущее) = Тип("Массив") Тогда

			Если Не ЭтоИндексМассива(ИмяЧасти) Тогда
				Возврат Неопределено;
			КонецЕсли;

			Индекс = Число(ИмяЧасти);
			Если Индекс < 0 Или Индекс >= Текущее.Количество() Тогда
				Возврат Неопределено;
			КонецЕсли;

			Текущее = Текущее[Индекс];

		ИначеЕсли ТипЗнч(Текущее) = Тип("Структура") Тогда

			Если Не Текущее.Свойство(ИмяЧасти) Тогда
				Возврат Неопределено;
			КонецЕсли;

			Текущее = Текущее[ИмяЧасти];

		Иначе
			Возврат Неопределено;
		КонецЕсли;

	КонецЦикла;

	Возврат Текущее;

КонецФункции

Процедура УстановитьЗначениеПоПути(Корень, Путь, Значение)

	Если ПустаяСтрока(Путь) Тогда
		Возврат;
	КонецЕсли;

	Части = СтрРазделить(Путь, ".", Ложь);
	Текущий = Корень;

	Для Индекс = 0 По Части.Количество() - 2 Цикл

		ИмяЧасти = Части[Индекс];
		Текущий = ПолучитьИлиСоздатьКонтейнер(Текущий, ИмяЧасти, Части[Индекс + 1]);

	КонецЦикла;

	ИмяПоследнейЧасти = Части[Части.Количество() - 1];
	ЗаписатьЗначениеВКонтейнер(Текущий, ИмяПоследнейЧасти, Значение);

КонецПроцедуры

Функция ПолучитьИлиСоздатьКонтейнер(Текущий, ИмяЧасти, ИмяСледующейЧасти)

	Если ТипЗнч(Текущий) = Тип("Массив") Тогда

		Индекс = Число(ИмяЧасти);
		Пока Текущий.Количество() <= Индекс Цикл
			Текущий.Добавить(Неопределено);
		КонецЦикла;

		Если Текущий[Индекс] = Неопределено Тогда
			Текущий[Индекс] = НовыйКонтейнерПоСледующейЧасти(ИмяСледующейЧасти);
		КонецЕсли;

		Возврат Текущий[Индекс];

	КонецЕсли;

	Если Не Текущий.Свойство(ИмяЧасти) Или Текущий[ИмяЧасти] = Неопределено Тогда
		Текущий.Вставить(ИмяЧасти, НовыйКонтейнерПоСледующейЧасти(ИмяСледующейЧасти));
	КонецЕсли;

	Возврат Текущий[ИмяЧасти];

КонецФункции

Процедура ЗаписатьЗначениеВКонтейнер(Контейнер, ИмяЧасти, Значение)

	Если ТипЗнч(Контейнер) = Тип("Массив") Тогда

		Индекс = Число(ИмяЧасти);
		Пока Контейнер.Количество() <= Индекс Цикл
			Контейнер.Добавить(Неопределено);
		КонецЦикла;

		Контейнер[Индекс] = Значение;
		Возврат;

	КонецЕсли;

	Контейнер.Вставить(ИмяЧасти, Значение);

КонецПроцедуры

Функция НовыйКонтейнерПоСледующейЧасти(ИмяСледующейЧасти)

	Если ЭтоИндексМассива(ИмяСледующейЧасти) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Новый Структура;

КонецФункции

Функция ЭтоИндексМассива(ИмяЧасти)

	Если ПустаяСтрока(ИмяЧасти) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для НомерСимвола = 1 По СтрДлина(ИмяЧасти) Цикл

		Символ = Сред(ИмяЧасти, НомерСимвола, 1);
		Если Символ < "0" Или Символ > "9" Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция ТекстОшибкиФорматаПоля(СтрокаСвойства, ЗначениеПоля)

	Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Строка Тогда

		Если ТипЗнч(ЗначениеПоля) <> Тип("Строка") Тогда
			Возврат СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть строкой.'"), СтрокаСвойства.Имя);
		КонецЕсли;

		Если СокрЛП(СтрокаСвойства.ФорматЗначения) = "ДД.ММ.ГГГГ"
			И Не СтрокаСоответствуетФорматуДаты(ЗначениеПоля) Тогда

			Возврат СтрШаблон(
				НСтр("ru = 'Поле ""%1"" должно содержать дату в формате ДД.ММ.ГГГГ.'"),
				СтрокаСвойства.Имя);

		КонецЕсли;

		Возврат "";

	КонецЕсли;

	Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Число
		Или СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Целое Тогда

		Если ТипЗнч(ЗначениеПоля) <> Тип("Число") Тогда
			Возврат СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть числом.'"), СтрокаСвойства.Имя);
		КонецЕсли;

		Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Целое
			И ЗначениеПоля <> Цел(ЗначениеПоля) Тогда

			Возврат СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть целым числом.'"), СтрокаСвойства.Имя);

		КонецЕсли;

		Возврат "";

	КонецЕсли;

	Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Булево Тогда

		Если ТипЗнч(ЗначениеПоля) <> Тип("Булево") Тогда
			Возврат СтрШаблон(НСтр("ru = 'Поле ""%1"" должно быть булевым значением.'"), СтрокаСвойства.Имя);
		КонецЕсли;

	КонецЕсли;

	Возврат "";

КонецФункции

Функция СтрокаСоответствуетФорматуДаты(ЗначениеСтроки)

	Если СтрДлина(ЗначениеСтроки) <> 10 Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Сред(ЗначениеСтроки, 3, 1) <> "." Или Сред(ЗначениеСтроки, 6, 1) <> "." Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		ДатаЗначения = Дата(
			Число(Сред(ЗначениеСтроки, 7, 4)),
			Число(Сред(ЗначениеСтроки, 4, 2)),
			Число(Сред(ЗначениеСтроки, 1, 2)));
		Возврат Формат(ДатаЗначения, "ДФ=dd.MM.yyyy") = ЗначениеСтроки;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

// Безопасно приводит значение JSON к типу поля схемы. При невозможности приведения
// возвращает Неопределено — поле просто не попадёт в нормализованный ответ.
//
Функция БезопасноеПриведениеЗначения(СтрокаСвойства, ЗначениеПоля)

	Если ЗначениеПоляОтсутствует(ЗначениеПоля) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТипПоля = СтрокаСвойства.Тип;

	Если ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Строка Тогда

		Если СокрЛП(СтрокаСвойства.ФорматЗначения) = "ДД.ММ.ГГГГ"
			И ТипЗнч(ЗначениеПоля) = Тип("Строка")
			И СтрокаСоответствуетФорматуДаты(ЗначениеПоля) Тогда

			Попытка
				Возврат Дата(
					Число(Сред(ЗначениеПоля, 7, 4)),
					Число(Сред(ЗначениеПоля, 4, 2)),
					Число(Сред(ЗначениеПоля, 1, 2)));
			Исключение
				Возврат Неопределено;
			КонецПопытки;

		КонецЕсли;

		Возврат Строка(ЗначениеПоля);

	КонецЕсли;

	Если ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Число Тогда

		Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
			Возврат ЗначениеПоля;
		КонецЕсли;

		Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
			Попытка
				Возврат Число(СокрЛП(ЗначениеПоля));
			Исключение
				Возврат Неопределено;
			КонецПопытки;
		КонецЕсли;

		Возврат Неопределено;

	КонецЕсли;

	Если ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Целое Тогда

		Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
			Возврат Цел(ЗначениеПоля);
		КонецЕсли;

		Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
			Попытка
				Возврат Цел(Число(СокрЛП(ЗначениеПоля)));
			Исключение
				Возврат Неопределено;
			КонецПопытки;
		КонецЕсли;

		Возврат Неопределено;

	КонецЕсли;

	Если ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Булево Тогда

		Если ТипЗнч(ЗначениеПоля) = Тип("Булево") Тогда
			Возврат ЗначениеПоля;
		КонецЕсли;

		Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда

			СтрокаЗначения = ВРег(СокрЛП(ЗначениеПоля));
			Если СтрокаЗначения = "TRUE" Тогда
				Возврат Истина;
			ИначеЕсли СтрокаЗначения = "FALSE" Тогда
				Возврат Ложь;
			КонецЕсли;

		КонецЕсли;

		Возврат Неопределено;

	КонецЕсли;

	Возврат ЗначениеПоля;

КонецФункции

// Тонкая обёртка над БезопасноеПриведениеЗначения. Возвращает Неопределено, если приведение
// невозможно — каллер обязан пропустить такое поле при нормализации.
//
Функция ПривестиЗначениеПоля(СтрокаСвойства, ЗначениеПоля)

	Возврат БезопасноеПриведениеЗначения(СтрокаСвойства, ЗначениеПоля);

КонецФункции

Функция ДаНетПоФлагу(Флаг)

	Если Флаг Тогда
		Возврат НСтр("ru = 'да'");
	КонецЕсли;

	Возврат НСтр("ru = 'нет'");

КонецФункции

Функция СгруппироватьПроверкиПоКлассу(Проверки)

	Группы = Новый Массив;
	КартаГрупп = Новый Соответствие;

	Для Каждого Проверка Из Проверки Цикл

		Группа = КартаГрупп.Получить(Проверка.Класс);
		Если Группа = Неопределено Тогда

			Группа = Новый Структура;
			Группа.Вставить("Класс", Проверка.Класс);
			Группа.Вставить("Проверки", Новый Массив);

			КартаГрупп.Вставить(Проверка.Класс, Группа);
			Группы.Добавить(Группа);

		КонецЕсли;

		Группа.Проверки.Добавить(Проверка);

	КонецЦикла;

	Возврат Группы;

КонецФункции

Функция СформироватьСтрокуПримераПроверки(Проверка)

	ПутьКПолю = Проверка.ПутьКПолю;
	Если ПустаяСтрока(ПутьКПолю) Тогда
		ПутьКПолю = НСтр("ru = '(весь ответ)'");
	КонецЕсли;

	Результат = СтрШаблон("  • [%1]", ПутьКПолю);

	Если Не ПустаяСтрока(Проверка.Сообщение) Тогда
		Результат = Результат + ": " + Проверка.Сообщение;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
